common/services/applog/AppLogService.php

    public static function addErrorLog($appname,$content)
    {
        $error = \Yii::$app->errorHandler->exception;
        $models_app_log = new AppLog();
        $models_app_log->app_name=$appname;
        $models_app_log->content=$content;
        //获取ip
        $models_app_log->ip = UtilService::getIP();
        if (!empty($_SERVER['HTTP_USER_AGENT'])){
            $models_app_log->ua = $_SERVER['HTTP_USER_AGENT'];
        }

        if ($error){
            $models_app_log->err_code = $error->getCode();
            if (isset($error->statusCode)){
                $models_app_log->http_code = $error->statusCode;
            }

            if (method_exists($error,'getName')){
                $models_app_log->err_name = $error->getName();
            }
        }

        $models_app_log->created_time = date('Y-m-d H:i:s');
        $models_app_log->save();
---
INSERT INTO `app_log` (`app_name`, `content`, `ip`, `ua`, `err_code`, `http_code`, `err_name`, `created_time`) VALUES ('basic', 'Page not found.[file:D:\\http\\Apache24\\htdocs\\basic\\vendor\\yiisoft\\yii2\\web\\Application.php][line:115][code:0][url:/layui/layui/js][POST_DATA:]', '123.180.177.112', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36 SE 2.X MetaSr 1.0', 0, 404, 'Not Found', '2019-06-26 10:04:01')